## To import two dataset

In [2]:
import pandas as pd

In [ ]:
deliveries=pd.read_csv("../deliveries.csv")
matches=pd.read_csv("../matches.csv")

In [8]:
deliveries.shape

(150460, 21)

In [9]:
matches.shape

(636, 18)

## To merge two datafremes must be have relationship

In [10]:
new_data=deliveries.merge(matches,left_on="match_id",right_on="id")

In [11]:
new_data.shape

(150460, 39)

In [17]:
new_data.groupby(["season","batsman"])['batsman_runs'].sum().sort_values(ascending=False)

season  batsman
2016    V Kohli        973
        DA Warner      848
2013    MEK Hussey     733
2012    CH Gayle       733
2013    CH Gayle       720
                      ...
2017    MM Patel         0
2012    AC Blizzard      0
2011    AB Dinda         0
2017    AD Nath          0
2008    L Balaji         0
Name: batsman_runs, Length: 1531, dtype: int64

## To the batsman that make high score in one season

In [18]:
new_data.groupby(["season","batsman"])['batsman_runs'].sum().sort_values(ascending=False).reset_index()

      season      batsman  batsman_runs
0       2016      V Kohli           973
1       2016    DA Warner           848
2       2013   MEK Hussey           733
3       2012     CH Gayle           733
4       2013     CH Gayle           720
...      ...          ...           ...
1526    2017     MM Patel             0
1527    2012  AC Blizzard             0
1528    2011     AB Dinda             0
1529    2017      AD Nath             0
1530    2008     L Balaji             0

[1531 rows x 3 columns]

In [21]:
new_data.groupby(["season","batsman"])['batsman_runs'].sum().sort_values(ascending=False).reset_index().drop_duplicates(subset='season',keep='first')

    season       batsman  batsman_runs
0     2016       V Kohli           973
2     2013    MEK Hussey           733
3     2012      CH Gayle           733
6     2014    RV Uthappa           660
7     2017     DA Warner           641
9     2010  SR Tendulkar           618
10    2008      SE Marsh           616
11    2011      CH Gayle           608
14    2009     ML Hayden           572
17    2015     DA Warner           562

In [22]:
new_data.groupby(["season","batsman"])['batsman_runs'].sum().sort_values(ascending=False).reset_index().drop_duplicates(subset='season',keep='first').sort_values("season")

    season       batsman  batsman_runs
10    2008      SE Marsh           616
14    2009     ML Hayden           572
9     2010  SR Tendulkar           618
11    2011      CH Gayle           608
3     2012      CH Gayle           733
2     2013    MEK Hussey           733
6     2014    RV Uthappa           660
17    2015     DA Warner           562
0     2016       V Kohli           973
7     2017     DA Warner           641